NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/gcc_startup_nrf7120e_flpr.S
    .weak   UserSoftware_Handler
    .type   UserSoftware_Handler, %function
UserSoftware_Handler:
    j       .
    .size   UserSoftware_Handler, . - UserSoftware_Handler


    .weak   SuperVisorSoftware_Handler
    .type   SuperVisorSoftware_Handler, %function
SuperVisorSoftware_Handler:
    j       .
    .size   SuperVisorSoftware_Handler, . - SuperVisorSoftware_Handler


    .weak   MachineSoftware_Handler
    .type   MachineSoftware_Handler, %function
MachineSoftware_Handler:
    j       .
    .size   MachineSoftware_Handler, . - MachineSoftware_Handler


    .weak   UserTimer_Handler
    .type   UserTimer_Handler, %function
UserTimer_Handler:
    j       .
    .size   UserTimer_Handler, . - UserTimer_Handler


    .weak   SuperVisorTimer_Handler
    .type   SuperVisorTimer_Handler, %function
SuperVisorTimer_Handler:
    j       .
    .size   SuperVisorTimer_Handler, . - SuperVisorTimer_Handler


    .weak   MachineTimer_Handler
    .type   MachineTimer_Handler, %function
MachineTimer_Handler:
    j       .
    .size   MachineTimer_Handler, . - MachineTimer_Handler


    .weak   UserExternal_Handler
    .type   UserExternal_Handler, %function
UserExternal_Handler:
    j       .
    .size   UserExternal_Handler, . - UserExternal_Handler


    .weak   SuperVisorExternal_Handler
    .type   SuperVisorExternal_Handler, %function
SuperVisorExternal_Handler:
    j       .
    .size   SuperVisorExternal_Handler, . - SuperVisorExternal_Handler


    .weak   MachineExternal_Handler
    .type   MachineExternal_Handler, %function
MachineExternal_Handler:
    j       .
    .size   MachineExternal_Handler, . - MachineExternal_Handler


    .weak   CLICSoftware_Handler
    .type   CLICSoftware_Handler, %function
CLICSoftware_Handler:
    j       .
    .size   CLICSoftware_Handler, . - CLICSoftware_Handler


/* IRQ Handlers */

    .globl  Default_Handler
    .type   Default_Handler, %function
Default_Handler:
    j       .
    .size   Default_Handler, . - Default_Handler

    .macro  IRQ handler
    .weak   \handler
    .set    \handler, Default_Handler
    .endm

    IRQ  VPRCLIC_16_IRQHandler
    IRQ  VPRCLIC_17_IRQHandler
    IRQ  VPRCLIC_18_IRQHandler
    IRQ  VPRCLIC_19_IRQHandler
    IRQ  VPRCLIC_20_IRQHandler
    IRQ  VPRCLIC_21_IRQHandler
    IRQ  VPRCLIC_22_IRQHandler
    IRQ  VPRTIM_IRQHandler
    IRQ  SPU00_IRQHandler
    IRQ  MPC00_IRQHandler
    IRQ  MPC03_IRQHandler
    IRQ  AAR00_CCM00_IRQHandler
    IRQ  ECB00_IRQHandler
    IRQ  VPR00_IRQHandler
    IRQ  SERIAL00_IRQHandler
    IRQ  MRAMC_IRQHandler
    IRQ  CTRLAP_IRQHandler
    IRQ  CM33SS_IRQHandler
    IRQ  TIMER00_IRQHandler
    IRQ  AXONS_IRQHandler
    IRQ  EGU00_IRQHandler
    IRQ  CRACEN_IRQHandler
    IRQ  USBHS_IRQHandler
    IRQ  MSPI00_IRQHandler
    IRQ  MSPI01_IRQHandler
    IRQ  SERIAL01_IRQHandler
    IRQ  SPU10_IRQHandler
    IRQ  TIMER10_IRQHandler
    IRQ  EGU10_IRQHandler
    IRQ  RADIO_0_IRQHandler
    IRQ  RADIO_1_IRQHandler
    IRQ  IPCT10_0_IRQHandler
    IRQ  IPCT10_1_IRQHandler
    IRQ  IPCT10_2_IRQHandler
    IRQ  IPCT10_3_IRQHandler
    IRQ  SPU20_IRQHandler
    IRQ  SERIAL20_IRQHandler
    IRQ  SERIAL21_IRQHandler
    IRQ  SERIAL22_IRQHandler
    IRQ  EGU20_IRQHandler
    IRQ  TIMER20_IRQHandler
    IRQ  TIMER21_IRQHandler
    IRQ  TIMER22_IRQHandler
    IRQ  TIMER23_IRQHandler
    IRQ  TIMER24_IRQHandler
    IRQ  PDM20_IRQHandler
    IRQ  PDM21_IRQHandler
    IRQ  PWM20_IRQHandler
    IRQ  PWM21_IRQHandler
    IRQ  PWM22_IRQHandler
    IRQ  SAADC_IRQHandler
    IRQ  NFCT_IRQHandler
    IRQ  TEMP_IRQHandler
    IRQ  GPIOTE20_0_IRQHandler
    IRQ  GPIOTE20_1_IRQHandler
    IRQ  QDEC20_IRQHandler
    IRQ  QDEC21_IRQHandler
    IRQ  GRTC_0_IRQHandler
    IRQ  GRTC_1_IRQHandler
    IRQ  GRTC_2_IRQHandler
    IRQ  GRTC_3_IRQHandler
    IRQ  GRTC_4_IRQHandler
    IRQ  GRTC_5_IRQHandler
    IRQ  TDM_IRQHandler
    IRQ  SERIAL23_IRQHandler
    IRQ  SERIAL24_IRQHandler
    IRQ  TAMPC_IRQHandler
    IRQ  SPU30_IRQHandler
    IRQ  SERIAL30_IRQHandler
    IRQ  COMP_LPCOMP_IRQHandler
    IRQ  WDT30_IRQHandler
    IRQ  WDT31_IRQHandler
    IRQ  GPIOTE30_0_IRQHandler
    IRQ  GPIOTE30_1_IRQHandler
    IRQ  CLOCK_POWER_IRQHandler
    IRQ  VREGUSB_IRQHandler
    IRQ  LFXO_IRQHandler
    IRQ  LFRC_IRQHandler
    IRQ  HFXO64M_IRQHandler
    IRQ  AUXPLL_AUXPM_IRQHandler

  .end
